---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings.GridLineWeight
source: html/0e793e9f-b24d-7f25-3fa2-a13dd752bfa2.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings.GridLineWeight Property

Line weight of grid lines.

## Syntax (C#)
```csharp
public int GridLineWeight { get; set; }
```